/*
    JQuery គឺជា​បណ្តាល័យ JavaScript ​ដែល​ ផ្តល់នូវប្រភេទវត្ថុប្រើប្រាស់ជាច្រើនសម្រាប់
    យកមកបង្កើតវេបផេកដែលអាចប្រែប្រួលខ្លួនដោយប្រើ
    ធនធានរបស់ម៉់ាស៊ីនអ្នកទន្សនា ។

    * ចំណាំរាល់កូដ​​ JQuery តែងតែផ្តើមសញ្ញា​ $

    Jquery ready event
    ជាព្រិត្តិការណ៍កំណត់ថាកូដដំណើរ​ការនៅពេលវេបផេកដំណើរការរួចរាល់
    ពោលគឺ អត្ដបទ រូបភាព​ បញ្ជី តារាង​ វីឌីអូ​ដែលមាននៅក្នុងផេក broswer
    បានដោតឡូតរួចរាល់ ។

    របៀបសរសេរ​ ready event
    ទម្រង់ធម្មតា
    $(document).ready(function(){
            កូដត្រូវដំណើរ;
    });

    ដើម្បីប្រើ jQueryប្រាស់​ត្រូវ
    ក.​ប្រើធាតុ​​​ script​​ ដើម្បីភ្ជាប់ទៅកាន់ឯកសារបណ្តាល័យ  jQuery
    ខ បង្កើតឯកសារ​ JavaScript ថ្មីមួយសម្រាប់សរសេរកូដ​ jQuery
    គ​​​ ប្រើធាតុ  Script ដើម្បីភ្ជាប់ទៅកាន់ឯកសារ​​ JavaScriptទើបបានបង្កើត
    ឃ​ ផ្តើមសរសេរក្នុងេកសារ JavaScript     j​​ដោយសារ​ jQuery ready event

*/​

$(function(){
    document.write("<h1> jQuery ready eveny is up! </h1>");
});