/*
    Javascript Object :
    Math ជាវត្ថុប្រើប្រាស់បំពេញមុខងារគណិតវិទ្យាដូចជា លេខចៃដន្យ បង្គត់លេខ ។ល។
        random()ជា​ method ដែលបំពេញមុខងារផ្តល់លេខទសភាគដោយចៃដន្យចន្លោះ ០​ និង​ ១។
        floor(លេខទសភាគ) បំពេញមុខងារបង្គត់ចុះនូវលេខទសភាគបានបញ្ជាក់។
        ceil(លេខទសភាគ) បំពេញមុខងារបង្គត់ឡើងនូវលេខទសភាគបានបញ្ជាក់។
        round(លេខទសភាគ) បំពេញមុខងារបង្គត់ចុះ ឬ​ ឡើង នូវលេខទសភាគបានបញ្ជាក់អាស្រ័យផ្នែកទសភាគតិចជាង៥ ឬ​ ធំជាង ឬ​ ស្មើ៥។
        
*/
/*
    Javascript Object :
    Math ជាវត្ថុប្រើប្រាស់បំពេញមុខងារគណិតវិទ្យាដូចជា លេខចៃដន្យ បង្គត់លេខ ។ល។
        random()ជា method ដែលបំពេញមុខងារផ្តល់លេខទសភាគដោយចៃដន្យចន្លោះ ០ និង ១។
        floor(លេខទសភាគ) បំពេញមុខងារបង្គត់ចុះនូវលេខទសភាគបានបញ្ជាក់។
        ceil(លេខទសភាគ) បំពេញមុខងារបង្គត់ឡើងនូវលេខទសភាគបានបញ្ជាក់។
        round(លេខទសភាគ) បំពេញមុខងារបង្គត់ចុះ ឬ ឡើង នូវលេខទសភាគបានបញ្ជាក់អាស្រ័យផ្នែកទសភាគតិចជាង៥ ឬ ធំជាង ឬ ស្មើ៥។

   
    ដូរការរចនា(dynamic style)
        ធាតុបានជ្រើសរើស.style.ឈ្មោះproperties= តម្លៃថី្ម;
    * ចំណា ពេលសរសេរឈោ្មះ css property ក្នុង javascript 
        មិនប្រើសពា្ញ - ទេតែរាល់អក្សរទី១ នៃពាក្យត្រូវដូរទៅអក្សរធំ
        ដោយគិតចាប់ពីពាក្យទី២ឡើងទៅដូចជាbackground-color
        សរសេរជា backgroundColor វិញទើបត្រូវ។

    javascript selector
    ជ្រើសយកធាតុមួយ
     document.querySelecttor("CSS selector")
    ជ្រើសយកធាតុជាច្រើន
     document.querySelectorAll("CSS selector")
    * ចំណា រាល់ CSS selector អាចប្រើក្នុង javascript បានដូចជា
     #អាយឧី .ថា្នក់ ។ល។


    បង្កើតធាតុ
      document.createElement("ធាតុត្រូវបង្កើត");
    បង្កើតខ្លឹមសារ
      document.createTextNode("ខ្លឹមសារ");
    ថែមខ្លឹមសារចូលក្នុងធាតុ
      ធាតុ.appendChild(ខ្លឹមសារ);
    ថែមធាតុចូលក្នុងវេបផេក
      មេធាតុ.appendChild(កូនធាតុ);
    
    បង្កើតគុណលក្ខណ

    doc.......
    

*/